# 코딩 테스트 준비 - 기초
# 백준 15988 1, 2, 3 더하기 3
# 등급 실버 2

# 문제 해결 아이디어
# 정수 N이 주어졌을 때, N을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하라
# N = 1 : (1) - 1개
# N = 2 : (1 + 1), (2) - 2개
# N = 3 : (1 + 1 + 1), (1 + 2), (2 + 1), (3) - 4개
# N = 4 : (1 + 1 + 1 + 1), (1 + 1 + 2), (1 + 2 + 1), (2 + 1 + 1), (2 + 2), (1 + 3), (3 + 1) - 7개
# N = 5 : (1 + 1 + 1 + 1 + 1), (1 + 1 + 1 + 2), (1 + 1 + 2 + 1), (1 + 2 + 1 + 1), (2 + 1 + 1 + 1),
#         (1 + 1 + 3), (1 + 3 + 1), (3 + 1 + 1),
#         (2 + 2 + 1), (2 + 1 + 2), (1 + 2 + 2),
#         (3 + 2), (2 + 3) - 13개
# N = 1, 2, 3일 때 각각 dp = 1, 2, 4
# 점화식
# dp[i] = dp[i - 1] + dp[i - 2] + dp[i - 3]

import sys
t = int(sys.stdin.readline().rstrip())
dp = [0] * 1000001
dp[0] = 1
dp[1] = 1
dp[2] = 2
dp[3] = 4

for i in range(4, 1000001):
    dp[i] = (dp[i - 1] + dp[i - 2] + dp[i - 3]) % 1000000009

for _ in range(t):
    n = int(sys.stdin.readline().rstrip())
    print(dp[n])
